#define MCU_HARDWARE_GLOBALS
#include "..\main\config.h"
/**********************************************************************
**º¯ÊýÔ­ÐÍ£º    void 	Timer0_Init( )
**Èë¿Ú²ÎÊý:º	ÎÞ
**³ö¿Ú²ÎÊý:		ÎÞ
**·µ »Ø Öµ£º	ÎÞ              
**Ëµ    Ã÷£º	³õÊ¼»¯¶¨Ê±Æ÷0
************************************************************************/
void Timer0_Init()
{
	TMOD = 0x11;
	TL0 = 0x0;
	TH0 = 0x80;
	TL1 = 0x0;
	TH1 = 0x80;
	TR0 = 1;
	ET0 = 1;
	TF0 = 0;
	TR1 = 1;
	ET1 = 1;
	TF1 = 0;
}
/**********************************************************************
**º¯ÊýÔ­ÐÍ£º    void 	Serial_Init( )
**Èë¿Ú²ÎÊý:º	ÎÞ
**³ö¿Ú²ÎÊý:		ÎÞ
**·µ »Ø Öµ£º	ÎÞ              
**Ëµ    Ã÷£º	³õÊ¼»¯´®¿Ú
************************************************************************/
/*
void Serial_Init()
{
//====ÉèÖÃ²¨ÌØÂÊ===================
tmod = tmod & 0x0f;
tmod = tmod | 0x20;
th1  = 0xfa;
tr1  = 1;
pcon = pcon | 0x80;     
//=======================
//¹¤×÷·½Ê½Îª8Î»Êý¾Ý
sm0 = 0; 
sm1 = 1; 
sm2 = 0;
tr1 = 1;          
//==========================
ren = 1;               //ÔÊÐí½ÓÊÕ
ti  = 1;
}
*/
/**********************************************************************
**º¯ÊýÔ­ÐÍ£º    void 	Interrupt_Init(void)
**Èë¿Ú²ÎÊý:º	ÎÞ
**³ö¿Ú²ÎÊý:		ÎÞ
**·µ »Ø Öµ£º	ÎÞ              
**Ëµ    Ã÷£º	³õÊ¼»¯ÖÐ¶Ï
************************************************************************/
void Interrupt_Init(void)
{
//¶¨Ê±Æ÷0ÔÊÐíÖÐ¶Ï
ET0 = 1; 
//======================	
ET1 = 1;	//¶¨Ê±Æ÷1ÖÐ¶Ï
PX1=1;
PT1=0;
PT0=0;
//======================
}
/*
void initial_system()
{
Delay_MS(1000);		//ÑÓÊ± 1 Ãë;
Timer0_Init();		//¶¨Ê±Æ÷0³õÊ¼»¯,ÔÚglobal.cÖÐ¶¨Òå
Serial_Init();		//´®¿Ú³õÊ¼»¯,ÔÚglobal.cÖÐ¶¨Òå
Interrupt_Init();	//ÖÐ¶Ï³õÊ¼»¯,ÔÚglobal.cÖÐ¶¨Òå

InitNic();			//RTL8019Ð¾Æ¬³õÊ¼»¯,ÔÚglobal.cÖÐ¶¨Òå
Delay_MS(10);			
Ping_Ip_Address.dwords=0x00000000;		//
//TCP1024.My_Port=my_ip_port;
Delay_MS(10);
for(i=0;i<3;i++)
	{TxdNetBuff.EtherFrame.SourceMacId[i]=My_MAC.words[i];}
TCP1024_Init();//TCP¶Ë¿Ú1024³õÊ¼»¯
}
*/
