/******************************************************************************
Copyright 2005 大连金德姆电子有限公司
All rights riserved.

文件名	：drv_ad7680.c
模块名称：AD芯片AD7680驱动程序
功能概要：AD芯片AD7680驱动程序

取代版本：0.0.1
修改人	：许岩
完成日期：2005.04.06
升级说明：create

******************************************************************************/
#include "config.h"

/******************************************************************************
 函数名称：Ad7680Init
 功能描述： AD芯片AD7680驱动初始化
 参数描述：
 参数名称： 输入/输出？ 类型        描述

 返  回  值：无

 作      者 ：许岩
 日      期：2005-04-11
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
void Ad7680Init(void)
{
	ToggleWD();

	PINSEL0 = PINSEL0 & (~BIT8);
	PINSEL0 = PINSEL0 & (~BIT9);        //P0.4 配置成GPIO       AD_CLK
	PINSEL0 = PINSEL0 & (~BIT10);
	PINSEL0 = PINSEL0 & (~BIT11);       //P0.5 配置成GPIO       AD_DOUT
	PINSEL0 = PINSEL0 & (~BIT12);
	PINSEL0 = PINSEL0 & (~BIT13);       //P0.6 配置成GPIO       AD_CS

//  PINSEL0 = PINSEL0 & (~BIT12);
//  PINSEL0 = PINSEL0 & (~BIT13);       //P0.6 配置成GPIO       AD_DIN
//  PINSEL1 = PINSEL1 & (~BIT2);
//  PINSEL1 = PINSEL1 & (~BIT3);        //P0.17 配置成GPIO      AD_EOC


	IO0DIR |= BIT4;         //P0.4设置为输出
	IO0DIR |= BIT6;         //P0.6设置为输出
	IO0DIR &= (~BIT5);      //P0.5设置为输入

//  IO0DIR |= BIT6;         //P0.6设置为输出
//  IO0DIR &= (~BIT17);     //P0.17设置为输入

	AD_CS_SET_HIGH();
	AD_CLK_SET_LOW();
//  AD_DIN_SET_LOW();
}

/******************************************************************************
 函数名称：SPI_CLK
 功能描述：SPI CLOCK一下
 参数描述：
 参数名称： 输入/输出？ 类型		描述
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2004-09-02
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void SPI_CLK(void)
{
//  Tlc2543Delay();
//  AD_CLK_SET_HIGH();
//  Tlc2543Delay();
//  AD_CLK_SET_LOW();
//  Tlc2543Delay();
//  ToggleWD();

	Tlc2543Delay();
	AD_CLK_SET_LOW();
	Tlc2543Delay();
	AD_CLK_SET_HIGH();
	Tlc2543Delay();
}

/******************************************************************************
 函数名称：GetAd7680
 功能描述：取得AD芯片值
 参数描述：
 参数名称： 输入/输出？ 类型		描述
				
 返  回  值：AD采样值,0-65535
				   
 作 	 者 ：许岩
 日 	 期：2004-09-02
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT16U GetAd7680(void)
{
	INT8U i = 0;
	INT32U result = 0;
//  INT16U send = 0;

	//ToggleWD();

	OS_ENTER_CRITICAL();

	AD_CLK_SET_HIGH();
	Tlc2543Delay();
	AD_CS_SET_LOW();
	Tlc2543Delay();

	for ( i=0; i<24; i++ )
	{
		result <<= 1;
		if ( (IO0PIN & BIT5) == 0 )
		{
		}
		else
		{
			result |= 0x0001;
		}
		SPI_CLK();
	}

	AD_CS_SET_HIGH();

	OS_EXIT_CRITICAL();

	result = result >> 4;

	return (INT16U)result;
}

/******************************************************************************
 函数名称：Tlc2543Delay
 功能描述：SPI Delay
 参数描述：
 参数名称： 输入/输出？ 类型		描述
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2004-09-02
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void Tlc2543Delay(void)
{
//  ToggleWD();
//  Sleep10us(1);
}



